Public Member Functions | Friends | List of all members
ACAPI::UI::Notification::NotificationBubble Class Reference
Notifications Manager
NotificationBubble is a tooltip-like small window, which can display various informations for the user. More...
#include <NotificationBubble.hpp>
 Inheritance diagram for ACAPI::UI::Notification::NotificationBubble:
 Public Member Functions
std::optional< GS::UniString >  | GetText () const
Returns the text of the notification bubble, if there is any. Otherwise, returns std::nullopt.
void  | SetText (const GS::UniString &text)
Changes the text of the notification bubble.
std::optional< DG::Icon >  | GetIcon () const
Returns the icon of the notification bubble, if there is any. Otherwise, returns std::nullopt.
void  | SetIcon (const DG::Icon &icon)
Changes the icon of the notification bubble.
std::optional< DG::Icon >  | GetLargeIcon () const
Returns the large icon of the notification bubble, if there is any. Otherwise, returns std::nullopt.
void  | SetLargeIcon (const DG::Icon &largeIcon)
Changes the large icon of the notification bubble.
UInt32  | GetTimeout () const
Returns the timeout, or, the lifetime of the notification bubble, in milliseconds.
void  | SetTimeout (const UInt32 timeoutMillisecs)
The timeout, or, the lifetime of the notification bubble, in milliseconds.
std::optional< UInt32 >  | GetRedrawCountLimit () const
Returns the redraw count limit of the notification bubble, if there is any. Otherwise, returns std::nullopt.
void  | SetRedrawCountLimit (const UInt32 redrawCountLimit)
The redraw count limit, which determines, that maximum how many times can the bubble appear.
void  | SetDisabled ()
Disable showing of the notification bubble.
API_Point  | GetOffset () const
Returns the offset of the bubble from the mouse origin.
void  | SetOffset (const API_Point &newOffset)
Sets the offset of the bubble from the mouse origin.
void  | Show (const API_Point &point)
Shows the notification bubble.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | NotificationBubbleManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
NotificationBubble is a tooltip-like small window, which can display various informations for the user.
Example code snippets from Notification Manager / Show notification bubble at local origo
 API_Coord3D localOrigo3D;
 if (auto getLocalOrigoResult = ACAPI_Database_GetLocOrigo (&localOrigo3D); getLocalOrigoResult != NoError) {
 ACAPI_WriteReport ("Failed to get Local Origo.", false);
 return;
 }
 API_Coord localOrigo;
 ACAPI_View_ModelToScreen (localOrigo3D, localOrigo);
 API_Point point;
 ACAPI_View_CoordToPoint (&localOrigo, &point);
 static constexpr const char* TestGuid = "255EACB7-197C-4176-B231-813D8F39AB29";
 auto notificationBubble = ACAPI::UI::Notification::CreateNotificationBubbleManager ().CreateNotificationBubble (APIGuidFromString (TestGuid));
 GS::UniString message = "This is a notification bubble at the local origo";
 notificationBubble.SetText (message);
 notificationBubble.SetIcon (DG::Icon (SysResModule, DG::Icon::Floppy));
 notificationBubble.SetTimeout (2000);
 notificationBubble.Show (point);
Since
Archicad 29
Member Function Documentation
◆ GetIcon()
 std::optional< DG::Icon > ACAPI::UI::Notification::NotificationBubble::GetIcon  |  ( |   | ) |   const
Returns the icon of the notification bubble, if there is any. Otherwise, returns std::nullopt.
Returns
the icon of the notification bubble, if there is any. Otherwise, returns std::nullopt.
◆ GetLargeIcon()
 std::optional< DG::Icon > ACAPI::UI::Notification::NotificationBubble::GetLargeIcon  |  ( |   | ) |   const
Returns the large icon of the notification bubble, if there is any. Otherwise, returns std::nullopt.
Returns
the large icon of the notification bubble, if there is any. Otherwise, returns std::nullopt.
Remarks
The large icon, if set, is used, when "Use large alert cues" option is on in Work Environment.
◆ GetOffset()
 API_Point ACAPI::UI::Notification::NotificationBubble::GetOffset  |  ( |   | ) |   const
Returns the offset of the bubble from the mouse origin.
Returns
the offset of the bubble from the mouse origin.
◆ GetRedrawCountLimit()
 std::optional< UInt32 > ACAPI::UI::Notification::NotificationBubble::GetRedrawCountLimit  |  ( |   | ) |   const
Returns the redraw count limit of the notification bubble, if there is any. Otherwise, returns std::nullopt.
Returns
the redraw count limit of the notification bubble, if there is any. Otherwise, returns std::nullopt.
◆ GetText()
 std::optional< GS::UniString > ACAPI::UI::Notification::NotificationBubble::GetText  |  ( |   | ) |   const
Returns the text of the notification bubble, if there is any. Otherwise, returns std::nullopt.
Returns
the text of the notification bubble, if there is any. Otherwise, returns std::nullopt.
◆ GetTimeout()
 UInt32 ACAPI::UI::Notification::NotificationBubble::GetTimeout  |  ( |   | ) |   const
Returns the timeout, or, the lifetime of the notification bubble, in milliseconds.
Returns
the timeout, or, the lifetime of the notification bubble, in milliseconds.
◆ SetDisabled()
 void ACAPI::UI::Notification::NotificationBubble::SetDisabled  |  ( |   | )
Disable showing of the notification bubble.
Remarks
: If this is called, then the bubble won't appear again. The 'Enable all informational messages' command reenables the bubble.
◆ SetIcon()
 void ACAPI::UI::Notification::NotificationBubble::SetIcon  |  ( |  const DG::Icon & |  icon | )
Changes the icon of the notification bubble.
Parameters
icon | Notification bubble icon to set.
◆ SetLargeIcon()
 void ACAPI::UI::Notification::NotificationBubble::SetLargeIcon  |  ( |  const DG::Icon & |  largeIcon | )
Changes the large icon of the notification bubble.
Parameters
largeIcon | Notification bubble large icon to set.
Remarks
The large icon, if set, is used, when "Use large alert cues" option is on in Work Environment.
◆ SetOffset()
 void ACAPI::UI::Notification::NotificationBubble::SetOffset  |  ( |  const API_Point & |  newOffset | )
Sets the offset of the bubble from the mouse origin.
Parameters
newOffset | the new offset of the bubble from the mouse origin to be set.
◆ SetRedrawCountLimit()
 void ACAPI::UI::Notification::NotificationBubble::SetRedrawCountLimit  |  ( |  const UInt32 |  redrawCountLimit | )
The redraw count limit, which determines, that maximum how many times can the bubble appear.
Parameters
redrawCountLimit | determines, that maximum how many times can the bubble appear.
Remarks
: after the bubble is shown redrawCountLimit times, it won't appear again. Until, user executes the 'Enable all informational messages' command.
◆ SetText()
 void ACAPI::UI::Notification::NotificationBubble::SetText  |  ( |  const GS::UniString & |  text | )
Changes the text of the notification bubble.
Parameters
text | Notification bubble text to set.
◆ SetTimeout()
 void ACAPI::UI::Notification::NotificationBubble::SetTimeout  |  ( |  const UInt32 |  timeoutMillisecs | )
The timeout, or, the lifetime of the notification bubble, in milliseconds.
Parameters
timeoutMillisecs | The bubble will disappear after this amount of milliseconds. Default value is 1000 milliseconds, or 1 seconds.
◆ Show()
 void ACAPI::UI::Notification::NotificationBubble::Show  |  ( |  const API_Point & |  point | )
Shows the notification bubble.
Parameters
point | The pixel coordinate, where the notification will be displayed.